RT-Thread/rt-thread/bsp/stm32/libraries/HAL_Drivers/drivers/drv_adc_v2.c
#ifdef ADC2
    if ((instance == ADC2) && ((mask & STM32_ADC_INSTANCE_MASK_ADC2) != 0U))
    {
        return RT_TRUE;
    }
#endif /* ADC2 */

#ifdef ADC3
    if ((instance == ADC3) && ((mask & STM32_ADC_INSTANCE_MASK_ADC3) != 0U))
    {
        return RT_TRUE;
    }
#endif /* ADC3 */

#ifdef ADC4
    if ((instance == ADC4) && ((mask & STM32_ADC_INSTANCE_MASK_ADC4) != 0U))
    {
        return RT_TRUE;
    }
#endif /* ADC4 */

#ifdef ADC5
    if ((instance == ADC5) && ((mask & STM32_ADC_INSTANCE_MASK_ADC5) != 0U))
    {
        return RT_TRUE;
    }
#endif /* ADC5 */

    return RT_FALSE;
}

/**
 * @brief Check whether one internal HAL channel is supported by the current ADC instance.
 * @param adc Pointer to the STM32 ADC device object.
 * @param hal_channel HAL ADC channel identifier.
 * @param instance_mask ADC instance mask allowed to access this internal channel.
 * @return RT_TRUE if the channel is available on the current ADC instance, otherwise RT_FALSE.
 */
static rt_bool_t stm32_adc_internal_channel_supported(struct stm32_adc *adc, uint32_t hal_channel, rt_uint32_t instance_mask)
{
    if (stm32_adc_hal_channel_valid(hal_channel) != RT_TRUE)
    {
        return RT_FALSE;
    }

    return stm32_adc_instance_match(adc->handle.Instance, instance_mask);
}

/**
 * @brief Find the internal ADC channel capability entry by logical channel.
 * @param channel RT-Thread logical ADC channel identifier.
 * @return Pointer to the internal-channel entry, or RT_NULL if the channel is not internal.
 */
static const struct stm32_adc_internal_channel *stm32_adc_find_internal_channel(rt_uint8_t channel)
{
    rt_size_t index;

    for (index = 0U; index < RT_ARRAY_SIZE(stm32_adc_internal_channels); index++)
    {
        if ((stm32_adc_internal_channels[index].logical_channel >= 0) &&
            ((rt_uint8_t)stm32_adc_internal_channels[index].logical_channel == channel))
        {
            return &stm32_adc_internal_channels[index];
        }
    }

    return RT_NULL;
}

/**
 * @brief Get an instance-aware HAL channel identifier for an ADC channel.
 * @param adc Pointer to the STM32 ADC device object.
 * @param channel RT-Thread logical ADC channel identifier.
 * @param hal_channel Pointer to the output HAL ADC channel identifier.
 * @return Operation status.
 */
static rt_err_t stm32_adc_get_channel_for_instance(struct stm32_adc *adc, rt_uint8_t channel, uint32_t *hal_channel)
{
    const struct stm32_adc_internal_channel *internal_channel;
    rt_err_t result;

    internal_channel = stm32_adc_find_internal_channel(channel);
    if (internal_channel != RT_NULL)
    {
        if (stm32_adc_internal_channel_supported(adc, internal_channel->hal_channel, internal_channel->instance_mask) == RT_TRUE)
        {
            *hal_channel = internal_channel->hal_channel;
            return RT_EOK;
        }

        if (stm32_adc_internal_channel_supported(adc, internal_channel->alternate_hal_channel,
                                                 internal_channel->alternate_instance_mask) == RT_TRUE)
        {
            *hal_channel = internal_channel->alternate_hal_channel;
            return RT_EOK;
        }

        return -RT_ENOSYS;
    }

    result = stm32_adc_get_channel(channel, hal_channel);
    if ((result == RT_EOK) && (stm32_adc_hal_channel_valid(*hal_channel) != RT_TRUE))
    {
        return -RT_EINVAL;
    }

    return result;
}

/**
 * @brief Get the HAL ADC channel identifier.
 * @param channel RT-Thread ADC channel identifier.
 * @param hal_channel Pointer to the output HAL channel identifier.
 * @return Operation status.
 */
rt_err_t stm32_adc_get_channel(rt_uint8_t channel, uint32_t *hal_channel)
{
    if (((rt_size_t)channel >= RT_ARRAY_SIZE(stm32_adc_channel_table)) ||
        (stm32_adc_hal_channel_valid(stm32_adc_channel_table[(rt_size_t)channel]) != RT_TRUE))
    {
        return -RT_EINVAL;
    }

    *hal_channel = stm32_adc_channel_table[(rt_size_t)channel];
    return RT_EOK;
}

/**
 * @brief Get the logical channel used to sample STM32 VREF.
 * @param adc Pointer to the STM32 ADC device object.
 * @param channel Pointer to the output logical VREFINT channel.
 * @return Operation status.
 */
rt_err_t stm32_adc_get_vref_logical_channel(struct stm32_adc *adc, rt_uint8_t *channel)
{
    uint32_t hal_channel;
    rt_err_t result;

    if (STM32_ADC_VREF_CHANNEL < 0)
    {
        return -RT_ENOSYS;
    }

    result = stm32_adc_get_channel_for_instance(adc, (rt_uint8_t)STM32_ADC_VREF_CHANNEL, &hal_channel);
    if (result != RT_EOK)
    {
        return result;
    }

    RT_UNUSED(hal_channel);
    *channel = (rt_uint8_t)STM32_ADC_VREF_CHANNEL;
    return RT_EOK;
}

/**
 * @brief Get the logical channel used to sample STM32 internal temperature sensor.
 * @param adc Pointer to the STM32 ADC device object.
 * @param channel Pointer to the output logical temperature-sensor channel.
 * @return Operation status.
 */
rt_err_t stm32_adc_get_tempsensor_logical_channel(struct stm32_adc *adc, rt_uint8_t *channel)
{
    uint32_t hal_channel;
    rt_err_t result;

    if (STM32_ADC_TEMP_CHANNEL < 0)
    {
        return -RT_ENOSYS;
    }

    result = stm32_adc_get_channel_for_instance(adc, (rt_uint8_t)STM32_ADC_TEMP_CHANNEL, &hal_channel);
    if (result != RT_EOK)
    {
        return result;
    }

    RT_UNUSED(hal_channel);
    *channel = (rt_uint8_t)STM32_ADC_TEMP_CHANNEL;
    return RT_EOK;
}

/**
 * @brief Get the logical channel used to sample STM32 internal VBAT divider.
 * @param adc Pointer to the STM32 ADC device object.
 * @param channel Pointer to the output logical VBAT channel.
 * @return Operation status.
 */
rt_err_t stm32_adc_get_vbat_logical_channel(struct stm32_adc *adc, rt_uint8_t *channel)
{
    uint32_t hal_channel;
    rt_err_t result;

    if (STM32_ADC_VBAT_CHANNEL < 0)
    {
        return -RT_ENOSYS;
    }

    result = stm32_adc_get_channel_for_instance(adc, (rt_uint8_t)STM32_ADC_VBAT_CHANNEL, &hal_channel);
    if (result != RT_EOK)
    {
        return result;
    }

