RT-Thread/rt-thread/bsp/stm32/libraries/HAL_Drivers/drivers/drv_adc_v2.c
    return -RT_ENOSYS;
#endif /* defined(STM32_ADC_HAS_LL_TEMPERATURE_CALC) */
}

#if defined(STM32_ADC_HAS_ENUM_RANK)
/**
 * @brief STM32 ADC regular-rank mapping entry.
 */
struct stm32_adc_rank_map
{
    rt_bool_t valid;   /**< Whether this logical rank is supported by HAL. */
    uint32_t hal_rank; /**< HAL regular-rank enumeration value. */
};

/**
 * @brief HAL regular-rank values indexed by logical rank.
 */
static const struct stm32_adc_rank_map stm32_adc_rank_table[] = {
    { RT_FALSE, 0U },
#ifdef ADC_REGULAR_RANK_1
    { RT_TRUE, ADC_REGULAR_RANK_1 },
#else
    { RT_FALSE, 0U },
#endif /* ADC_REGULAR_RANK_1 */
#ifdef ADC_REGULAR_RANK_2
    { RT_TRUE, ADC_REGULAR_RANK_2 },
#else
    { RT_FALSE, 0U },
#endif /* ADC_REGULAR_RANK_2 */
#ifdef ADC_REGULAR_RANK_3
    { RT_TRUE, ADC_REGULAR_RANK_3 },
#else
    { RT_FALSE, 0U },
#endif /* ADC_REGULAR_RANK_3 */
#ifdef ADC_REGULAR_RANK_4
    { RT_TRUE, ADC_REGULAR_RANK_4 },
#else
    { RT_FALSE, 0U },
#endif /* ADC_REGULAR_RANK_4 */
#ifdef ADC_REGULAR_RANK_5
    { RT_TRUE, ADC_REGULAR_RANK_5 },
#else
    { RT_FALSE, 0U },
#endif /* ADC_REGULAR_RANK_5 */
#ifdef ADC_REGULAR_RANK_6
    { RT_TRUE, ADC_REGULAR_RANK_6 },
#else
    { RT_FALSE, 0U },
#endif /* ADC_REGULAR_RANK_6 */
#ifdef ADC_REGULAR_RANK_7
    { RT_TRUE, ADC_REGULAR_RANK_7 },
#else
    { RT_FALSE, 0U },
#endif /* ADC_REGULAR_RANK_7 */
#ifdef ADC_REGULAR_RANK_8
    { RT_TRUE, ADC_REGULAR_RANK_8 },
#else
    { RT_FALSE, 0U },
#endif /* ADC_REGULAR_RANK_8 */
#ifdef ADC_REGULAR_RANK_9
    { RT_TRUE, ADC_REGULAR_RANK_9 },
#else
    { RT_FALSE, 0U },
#endif /* ADC_REGULAR_RANK_9 */
#ifdef ADC_REGULAR_RANK_10
    { RT_TRUE, ADC_REGULAR_RANK_10 },
#else
    { RT_FALSE, 0U },
#endif /* ADC_REGULAR_RANK_10 */
#ifdef ADC_REGULAR_RANK_11
    { RT_TRUE, ADC_REGULAR_RANK_11 },
#else
    { RT_FALSE, 0U },
#endif /* ADC_REGULAR_RANK_11 */
#ifdef ADC_REGULAR_RANK_12
    { RT_TRUE, ADC_REGULAR_RANK_12 },
#else
    { RT_FALSE, 0U },
#endif /* ADC_REGULAR_RANK_12 */
#ifdef ADC_REGULAR_RANK_13
    { RT_TRUE, ADC_REGULAR_RANK_13 },
#else
    { RT_FALSE, 0U },
#endif /* ADC_REGULAR_RANK_13 */
#ifdef ADC_REGULAR_RANK_14
    { RT_TRUE, ADC_REGULAR_RANK_14 },
#else
    { RT_FALSE, 0U },
#endif /* ADC_REGULAR_RANK_14 */
#ifdef ADC_REGULAR_RANK_15
    { RT_TRUE, ADC_REGULAR_RANK_15 },
#else
    { RT_FALSE, 0U },
#endif /* ADC_REGULAR_RANK_15 */
#ifdef ADC_REGULAR_RANK_16
    { RT_TRUE, ADC_REGULAR_RANK_16 },
#else
    { RT_FALSE, 0U },
#endif /* ADC_REGULAR_RANK_16 */
};
#endif /* defined(STM32_ADC_HAS_ENUM_RANK) */

/**
 * @brief Convert one STM32 HAL status code to an RT-Thread error code.
 * @param status STM32 HAL operation status.
 * @return RT-Thread operation status.
 */
static rt_err_t stm32_hal_status_to_rt_err(HAL_StatusTypeDef status)
{
    switch (status)
    {
    case HAL_OK:
        return RT_EOK;

    case HAL_BUSY:
        return -RT_EBUSY;

    case HAL_TIMEOUT:
        return -RT_ETIMEOUT;

    case HAL_ERROR:
    default:
        return -RT_ERROR;
    }
}

/**
 * @brief Get one HAL rank value from a logical rank index.
 * @param rank Logical rank index starting from 1.
 * @param hal_rank Pointer to the output HAL rank value.
 * @return Operation status.
 */
static rt_err_t stm32_adc_get_rank_value(rt_uint32_t rank, uint32_t *hal_rank)
{
#if defined(STM32_ADC_HAS_ENUM_RANK)
    if ((rank >= RT_ARRAY_SIZE(stm32_adc_rank_table)) || (stm32_adc_rank_table[rank].valid != RT_TRUE))
    {
        return -RT_EINVAL;
    }

    *hal_rank = stm32_adc_rank_table[rank].hal_rank;
#elif defined(STM32_ADC_HAS_CHANNEL_NUMBER_RANK)
    RT_UNUSED(rank);
    *hal_rank = ADC_RANK_CHANNEL_NUMBER;
#else
    *hal_rank = rank;
#endif /* defined(STM32_ADC_HAS_ENUM_RANK) */

    return RT_EOK;
}

/**
 * @brief Enable ADC analog support required by a specific series.
 */
static void stm32_adc_enable_analog_support(void)
{
#if defined(STM32_ADC_NEEDS_ANALOG_SUPPLY)
    __HAL_RCC_PWR_CLK_ENABLE();
    HAL_PWREx_EnableVddA();
#endif /* defined(STM32_ADC_NEEDS_ANALOG_SUPPLY) */
}

#if defined(STM32_ADC_HAS_CALIBRATION)
/**
 * @brief Get the input-mode mask from STM32 private configuration.
 * @param cfg Pointer to the STM32 backend private configuration.
 * @return RT_ADC_INPUT_MODE_* mask used by calibration.
 */
static rt_uint8_t stm32_adc_get_input_modes(const struct stm32_adc_private_cfg *cfg)
{
    if (cfg->input_modes == 0U)
    {
        return RT_ADC_INPUT_MODE_SINGLE_ENDED;
    }

    return cfg->input_modes;
}

/**
 * @brief Run one calibration pass for a selected ADC input mode.
 * @param adc Pointer to the STM32 ADC device object.
 * @param calibration_mode HAL calibration mode selector.
 * @param input_mode HAL single-ended or differential selector.
 * @return Operation status.
 */
static rt_err_t stm32_adc_run_calibration_pass(struct stm32_adc *adc, uint32_t calibration_mode, uint32_t input_mode)
{
    HAL_StatusTypeDef status;
#if defined(STM32_ADC_HAS_SIMPLE_CALIBRATION)
    RT_UNUSED(calibration_mode);
    status = HAL_ADCEx_Calibration_Start(&adc->handle, input_mode);
    if (status != HAL_OK)
    {
        LOG_E("%s calibration failed", adc->name);
        return stm32_hal_status_to_rt_err(status);
    }
    return RT_EOK;
#elif defined(STM32_ADC_HAS_LINEAR_CALIBRATION)
    status = HAL_ADCEx_Calibration_Start(&adc->handle, calibration_mode, input_mode);
    if (status != HAL_OK)
    {
        LOG_E("%s calibration failed", adc->name);
        return stm32_hal_status_to_rt_err(status);
    }
    return RT_EOK;
#else
    RT_UNUSED(status);
    RT_UNUSED(calibration_mode);
    RT_UNUSED(input_mode);
    return -RT_ENOSYS;
#endif /* calibration feature buckets */
}

/**
 * @brief Run one series-specific ADC calibration from STM32 private configuration.
 * @param adc Pointer to the STM32 ADC device object.
 * @param private_cfg Pointer to the STM32 backend private configuration.
 * @return Operation status.
 */
static rt_err_t stm32_adc_run_calibration(struct stm32_adc *adc, const struct stm32_adc_private_cfg *private_cfg)
{
    rt_err_t result;
    rt_uint8_t requested_input_modes;
#if defined(STM32_ADC_HAS_LINEAR_CALIBRATION) && defined(ADC_CALIB_OFFSET)
    rt_bool_t single_ended_calibrated;
#endif /* defined(STM32_ADC_HAS_LINEAR_CALIBRATION) && defined(ADC_CALIB_OFFSET) */

    requested_input_modes = stm32_adc_get_input_modes(private_cfg);
    LOG_D("%s calibration request: modes=0x%02x", adc->name, requested_input_modes);

#if defined(STM32_ADC_HAS_SIMPLE_CALIBRATION)
    if ((requested_input_modes & RT_ADC_INPUT_MODE_SINGLE_ENDED) != 0U)
    {
        result = stm32_adc_run_calibration_pass(adc, 0U, STM32_ADC_SINGLE_ENDED_VALUE);
        if (result != RT_EOK)
        {
            return result;
        }
        LOG_I("%s single-ended calibration done", adc->name);
    }
    if ((requested_input_modes & RT_ADC_INPUT_MODE_DIFFERENTIAL) != 0U)
    {
        result = stm32_adc_run_calibration_pass(adc, 0U, STM32_ADC_DIFFERENTIAL_VALUE);
        if (result != RT_EOK)
        {
            return result;
        }
        LOG_I("%s differential calibration done", adc->name);
    }
    return RT_EOK;
#elif defined(STM32_ADC_HAS_LINEAR_CALIBRATION)
#if defined(ADC_CALIB_OFFSET)
    single_ended_calibrated = RT_FALSE;
#endif /* defined(ADC_CALIB_OFFSET) */
    if ((requested_input_modes & RT_ADC_INPUT_MODE_SINGLE_ENDED) != 0U)
    {
        result = stm32_adc_run_calibration_pass(adc, ADC_CALIB_OFFSET_LINEARITY, STM32_ADC_SINGLE_ENDED_VALUE);
        if (result != RT_EOK)
        {
            return result;
        }
#if defined(ADC_CALIB_OFFSET)
        single_ended_calibrated = RT_TRUE;
#endif /* defined(ADC_CALIB_OFFSET) */
        LOG_I("%s single-ended calibration done", adc->name);
    }
    if ((requested_input_modes & RT_ADC_INPUT_MODE_DIFFERENTIAL) != 0U)
    {
        result = stm32_adc_run_calibration_pass(adc,
#if defined(ADC_CALIB_OFFSET)
                                                (single_ended_calibrated == RT_TRUE) ? ADC_CALIB_OFFSET : ADC_CALIB_OFFSET_LINEARITY,
#else
                                                ADC_CALIB_OFFSET_LINEARITY,
#endif /* defined(ADC_CALIB_OFFSET) */
                                                STM32_ADC_DIFFERENTIAL_VALUE);
        if (result != RT_EOK)
        {
            return result;
        }
        LOG_I("%s differential calibration done", adc->name);
    }
    return RT_EOK;
#else
    RT_UNUSED(requested_input_modes);
    return -RT_ENOSYS;
#endif /* calibration feature buckets */
}

#endif /* defined(STM32_ADC_HAS_CALIBRATION) */

/**
 * @brief Fill the HAL ADC initialization structure from the device object.
 * @param adc Pointer to the STM32 ADC device object.
 * @return Operation status.
 */
static rt_err_t stm32_adc_fill_init(struct stm32_adc *adc)
{
    ADC_TypeDef *instance;

    LOG_D("%s fill init", adc->name);
    instance = adc->handle.Instance;
    rt_memset(&adc->handle, 0, sizeof(adc->handle));
    adc->handle.Instance = instance;
#ifdef ADC_DEFAULT_CLOCK_PRESCALER
    adc->handle.Init.ClockPrescaler = ADC_DEFAULT_CLOCK_PRESCALER;
#endif /* ADC_DEFAULT_CLOCK_PRESCALER */
#if defined(STM32_ADC_HAS_INIT_DATA_ALIGN)
    adc->handle.Init.DataAlign = (adc->config.data_align != 0U) ? adc->config.data_align : ADC_DEFAULT_DATA_ALIGN;
#endif /* defined(STM32_ADC_HAS_INIT_DATA_ALIGN) */
    adc->handle.Init.ScanConvMode = STM32_ADC_SCAN_MODE_DISABLE;
#if defined(STM32_ADC_HAS_INIT_EOC_SELECTION)
    adc->handle.Init.EOCSelection = ADC_EOC_SINGLE_CONV;
#endif /* defined(STM32_ADC_HAS_INIT_EOC_SELECTION) */
    adc->handle.Init.ContinuousConvMode = DISABLE;
#if defined(STM32_ADC_HAS_INIT_CONVERSION_DATA_MANAGEMENT)
    adc->handle.Init.ConversionDataManagement = ADC_CONVERSIONDATA_DR;
#endif /* defined(STM32_ADC_HAS_INIT_CONVERSION_DATA_MANAGEMENT) */
#if defined(STM32_ADC_HAS_INIT_NBR_OF_CONVERSION)
    adc->handle.Init.NbrOfConversion = 1;
#endif /* defined(STM32_ADC_HAS_INIT_NBR_OF_CONVERSION) */
    adc->handle.Init.DiscontinuousConvMode = DISABLE;
#if defined(STM32_ADC_HAS_INIT_NBR_OF_DISC_CONVERSION)
    adc->handle.Init.NbrOfDiscConversion = 1;
#endif /* defined(STM32_ADC_HAS_INIT_NBR_OF_DISC_CONVERSION) */
    adc->handle.Init.ExternalTrigConv = ADC_SOFTWARE_START;
#if defined(STM32_ADC_HAS_INIT_EXT_TRIG_EDGE)
    adc->handle.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
#endif /* defined(STM32_ADC_HAS_INIT_EXT_TRIG_EDGE) */
#if defined(STM32_ADC_HAS_INIT_DMA_CONT_REQUESTS)
    adc->handle.Init.DMAContinuousRequests = DISABLE;
#endif /* defined(STM32_ADC_HAS_INIT_DMA_CONT_REQUESTS) */
#if defined(STM32_ADC_HAS_HW_OVERSAMPLING)
    adc->handle.Init.OversamplingMode = DISABLE;
    adc->handle.Init.Oversampling.Ratio = 0U;
    adc->handle.Init.Oversampling.RightBitShift = 0U;
    adc->handle.Init.Oversampling.TriggeredMode = ADC_TRIGGEREDMODE_SINGLE_TRIGGER;
    adc->handle.Init.Oversampling.OversamplingStopReset = ADC_REGOVERSAMPLING_CONTINUED_MODE;
#endif /* defined(STM32_ADC_HAS_HW_OVERSAMPLING) */

#if defined(STM32_ADC_HAS_CONFIGURABLE_RESOLUTION)
    adc->handle.Init.Resolution = (adc->config.resolution != 0U) ? adc->config.resolution : ADC_DEFAULT_RESOLUTION;
#else
    if (adc->config.resolution != 0U)
    {
        return -RT_ENOSYS;
    }
#endif /* defined(STM32_ADC_HAS_CONFIGURABLE_RESOLUTION) */

