RT-Thread/rt-thread/bsp/stm32/libraries/HAL_Drivers/drivers/drv_adc_v2.c
    result = stm32_adc_get_sampling_time(&adc->config, &sampling_time);
    if (result != RT_EOK)
    {
        return result;
    }

    for (channel = 0U; channel < STM32_ADC_MAX_CHANNELS; channel++)
    {
        result = stm32_adc_get_channel_for_instance(adc, channel, &hal_channel);
        if (result != RT_EOK)
        {
            continue;
        }

        rt_memset(&config, 0, sizeof(config));
        config.Channel = hal_channel;
        config.Rank = ADC_RANK_NONE;
        config.SamplingTime = sampling_time;
#if defined(STM32_ADC_HAS_CONFIG_OFFSET)
        config.Offset = 0;
#endif /* defined(STM32_ADC_HAS_CONFIG_OFFSET) */
#if defined(STM32_ADC_HAS_CONFIG_OFFSET_NUMBER)
        config.OffsetNumber = ADC_OFFSET_NONE;
#endif /* defined(STM32_ADC_HAS_CONFIG_OFFSET_NUMBER) */
#if defined(STM32_ADC_HAS_SINGLE_DIFF_FIELDS)
        result = stm32_adc_get_single_diff(&adc->config, &config.SingleDiff);
        if ((result != RT_EOK) && (result != -RT_ENOSYS))
        {
            return result;
        }
#endif /* defined(STM32_ADC_HAS_SINGLE_DIFF_FIELDS) */

        status = HAL_ADC_ConfigChannel(&adc->handle, &config);
        if (status != HAL_OK)
        {
            LOG_E("%s clear channel config failed: channel=%u", adc->name, (unsigned int)channel);
            return stm32_hal_status_to_rt_err(status);
        }
    }

    LOG_D("%s channel config cleared", adc->name);
    return RT_EOK;
#else
    RT_UNUSED(adc);
    return -RT_ENOSYS;
#endif /* defined(STM32_ADC_HAS_CHANNEL_NUMBER_RANK) && defined(ADC_RANK_NONE) */
}

/**
 * @brief Configure all regular ADC ranks for one session.
 * @param adc Pointer to the STM32 ADC device object.
 * @param channels ADC channel selection mask.
 * @return Operation status.
 */
static rt_err_t stm32_adc_configure_session_ranks(struct stm32_adc *adc, rt_uint32_t channels)
{
    rt_uint32_t rank;
    rt_uint8_t channel;
    rt_err_t result;

    rank = 1U;
    while (channels != 0U)
    {
        if (rank > STM32_ADC_MAX_SEQUENCE)
        {
            return -RT_EINVAL;
        }

        channel = rt_adc_channel_mask_take_lsb(&channels);
        result = stm32_adc_configure_rank(adc, channel, rank);
        if (result != RT_EOK)
        {
            LOG_E("%s rank config failed: channel=%u rank=%lu result=%d",
                  adc->name, (unsigned int)channel, (unsigned long)rank, result);
            return result;
        }
        rank++;
    }

    return RT_EOK;
}

/**
 * @brief Apply one complete regular ADC configuration to STM32 HAL.
 * @param adc Pointer to the STM32 ADC device object.
 * @param channels ADC channel selection mask.
 * @return Operation status.
 */
static rt_err_t stm32_adc_apply_regular_config(struct stm32_adc *adc, rt_uint32_t channels)
{
    HAL_StatusTypeDef status;
    rt_size_t channel_count;
    rt_err_t result;

    channel_count = rt_adc_channel_mask_count(channels);
    if ((channel_count == 0U) || (channel_count > STM32_ADC_MAX_SEQUENCE))
    {
        return -RT_EINVAL;
    }

    result = stm32_adc_fill_init(adc);
    if (result != RT_EOK)
    {
        return result;
    }

    result = stm32_adc_apply_oversampling(adc);
    if (result != RT_EOK)
    {
        return result;
    }

    adc->handle.Init.ScanConvMode = (channel_count > 1U) ? STM32_ADC_SCAN_MODE_ENABLE : STM32_ADC_SCAN_MODE_DISABLE;
#if defined(STM32_ADC_HAS_INIT_NBR_OF_CONVERSION)
    adc->handle.Init.NbrOfConversion = channel_count;
#endif /* defined(STM32_ADC_HAS_INIT_NBR_OF_CONVERSION) */

#if defined(STM32_ADC_HAS_INIT_EOC_SELECTION)
    adc->handle.Init.EOCSelection = ADC_EOC_SINGLE_CONV;
#endif /* defined(STM32_ADC_HAS_INIT_EOC_SELECTION) */

    /* Multi-rank polling must not let one HAL_ADC_Start() drain the whole
     * regular sequence, otherwise DR can be overwritten before the CPU reads it.
     * Discontinuous mode makes each HAL_ADC_Start() convert one rank only.
     */
    adc->handle.Init.DiscontinuousConvMode = (channel_count > 1U) ? ENABLE : DISABLE;

    stm32_adc_force_poll_mode(adc);

    status = HAL_ADC_Init(&adc->handle);
    if (status != HAL_OK)
    {
        LOG_E("%s regular init failed", adc->name);
        return stm32_hal_status_to_rt_err(status);
    }
    return stm32_adc_configure_session_ranks(adc, channels);
}

/**
 * @brief Configure one ADC conversion session on one STM32 ADC device.
 * @param device Pointer to the ADC device object.
 * @param channels ADC channel selection mask.
 * @return Operation status.
 */
static rt_err_t stm32_adc_session_config(struct rt_adc_device *device, rt_uint32_t channels)
{
    struct stm32_adc *adc;

    adc = (struct stm32_adc *)device->parent.user_data;
    if (adc == RT_NULL)
    {
        return -RT_EINVAL;
    }

    return stm32_adc_apply_regular_config(adc, channels);
}

/**
 * @brief Start one STM32 ADC finite sequence session.
 * @param device Pointer to the ADC device object.
 * @param channels ADC channel selection mask.
 * @param cfg Pointer to the ADC sequence request object.
 * @return Operation status.
 */
static rt_err_t stm32_adc_sequence_start(struct rt_adc_device *device, rt_uint32_t channels,
                                           const struct rt_adc_sequence_cfg *cfg)
{
    RT_UNUSED(device);
    RT_UNUSED(channels);
    RT_UNUSED(cfg);

    return RT_EOK;
}

/**
 * @brief Read one sample from one STM32 ADC sequence session.
 * @param device Pointer to the ADC device object.
 * @param value Pointer to the output sample value.
 * @param timeout_ms Read timeout in milliseconds.
 * @return Operation status.
 */
static rt_err_t stm32_adc_sequence_read(struct rt_adc_device *device, rt_uint32_t *value, rt_int32_t timeout_ms)
{
    struct stm32_adc *adc;
    HAL_StatusTypeDef status;
    uint32_t timeout;

    adc = (struct stm32_adc *)device->parent.user_data;
    if (adc == RT_NULL)
    {
        return -RT_EINVAL;
    }

    status = HAL_ADC_Start(&adc->handle);
    if (status != HAL_OK)
    {
        goto fail;
    }

    timeout = (timeout_ms < 0) ? HAL_MAX_DELAY : (uint32_t)timeout_ms;
    status = HAL_ADC_PollForConversion(&adc->handle, timeout);
    if (status != HAL_OK)
    {
        goto fail;
    }

    *value = (rt_uint32_t)HAL_ADC_GetValue(&adc->handle);
    LOG_D("%s sample read: value=%lu", adc->name, (unsigned long)*value);

